app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def index
    if current_user
      @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    if current_user
      @user = User.find(session[:user_id])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    @user = User.find params[:id]
    @user.destroy